Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལའང་། །ཐམས་ཅད་ཟང་ཟིང་མེད་པའི་ཆོས་སྦྱིན་བྱེད། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be twenty-six consecutive congregations, Each of them gathering two hundred twenty million “Who grant the Dharma without concern for material things.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །འཕང་སྲིད་དུ་ནི་དཔག་ཚད་བཞི་འཕགས་ལ། །གསེར་གྱི་རྒྱན་དག་གིས་ནི་འཁོར་བར་བསྐོར། །
en: The relics of this victor will reside in a single stūpa “That is four leagues tall And studded with golden ornaments.

source: དེ་བཞིན་གཤེགས་པ་དོན་དགོངས་གཏི་མུག་བྲལ། །སྐྱེ་ཡུལ་རྣམ་པར་གྲོལ་བ་མཆོག་ཅེས་བྱ། །
en: The thus-gone Vigata­mohārtha­cintin will be born In a place called Supreme Liberation.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གསུམ་ཡབ་ནི་ལེགས་བཟང་ཡིན། །བཟང་བྱེད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend thirty-three leagues. Fine Excellence will be his father, and Doer of Good will be this victor’s mother.

source: སྲས་པོ་བཟང་ལྡན་ཟླ་ལེགས་རིམ་གྲོ་པ། །
en: Endowed with Excellence will be his son and Excellent Moon his attendant.

source: ཡོན་ཏན་གྲགས་པར་བྱེད་པ་བློ་ཅན་ཏེ། །
en: “Spreading the Fame of Excellent Qualities will be the scholar

source: འཇིག་རྟེན་རྣམ་པར་སྣང་བྱེད་རྫུ་འཕྲུལ་ཅན། །
en: And Destroyer of the Māras the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་གཅིག་ཀུན་ལའང་། །ཁུར་བོར་ཕ་རོལ་དག་ཏུ་ཕྱིན་པ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་དགུ་དགུ་ཡོད། །
en: There will be ninety-one consecutive congregations, Each of them gathering nine hundred ninety million of this able one’s worthy ones “Who have shed their loads and achieved perfection.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །
en: And the sacred Dharma of the one who attained nirvāṇa

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་ཀུན་ནས་ལེགས་པར་སྤྲས། །
en: “The relics of this victor will reside in a single stūpa Five leagues large and beautifully decorated.

source: སངས་རྒྱས་དབྱངས་ཀྱི་ཡན་ལག་ཁྱད་འཕགས་ཀྱི། །སྐྱེ་ཡུལ་ཁྱད་འཕགས་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The buddha Viśiṣṭa­svarāṅga will be born In a place called Superior Illumination.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་ང་རོ་མཆོག །གདངས་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །ཁ་ལོ་སྒྱུར་སྲས་ཡིད་འཐད་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend seventy-two leagues. Supreme Roar will be his father, and Supreme Tones will be this victor’s mother. Leader will be his son and Mind of Reason his attendant.

source: རབ་ཏུ་ཞི་བའི་ང་རོ་མཁས་པ་སྟེ། །
en: “Pacifying Roar will be the scholar

source: དབྱངས་ཀྱི་ཡན་ལག་ཁྱད་འཕགས་རྫུ་འཕྲུལ་ཅན། །
en: And Superior Aspects of Melody the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལའང་། །ལྟ་བ་བསལ་བ་གཏི་མུག་མེད་གྱུར་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: There will be twenty-six consecutive congregations, Each of them gathering two hundred million “Who have dispelled beliefs and are free from ignorance.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་གསེར་གྱིས་མཛེས་པར་བྱས། །
en: “The relics of this victor will reside in a single stūpa Eight leagues large and ornamented with gold.

source: རྒྱལ་བ་མཆོག་ཏུ་མཛེས་པར་གཤེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་བསྔགས་ཞེས་བྱ། །
en: The victor Laḍitāgragāmin will be born In a place called Praised in the World.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱ་ཡོད་ཡབ་ནི་ལྷ་བཟང་ཡིན། །ཆོས་ཀྱི་དབང་ཕྱུག་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend one hundred leagues. Divine Excellence will be his father, and Lady Who Masters the Dharma will be this victor’s mother.

source: སྲས་པོ་ཐར་བྱེད་རྣམ་ཐར་རིམ་གྲོ་པ། །
en: Liberator will be his son and Liberation his attendant.

source: རྣམ་གྲོལ་གསལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Luminous Liberation the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གསུམ་ཀུན་ལའང་། །དགྲ་བཅོམ་ཟླ་བ་ཉ་དང་འདྲ་བ་པོ། །དེ་དག་ཐེར་འབུམ་ཕྲག་ནི་གསུམ་གསུམ་ཡོད། །
en: There will be twenty-three consecutive congregations, Each of them gathering three billion “Worthy ones who resemble the full moon.

source: མྱ་ངན་འདས་ནས་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And when this teacher has attained nirvāṇa His sacred Dharma will remain for twenty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །གསེར་གྱི་བླ་རེ་རྒྱལ་མཚན་དག་གིས་བསྐོར། །
en: “The relics of this victor will reside in a single stūpa Covered by golden canopies and encircled by banners.

source: འཇིག་རྟེན་མཆོག་མ་ཞི་དོན་སྐྱེ་བའི་ཡུལ། །རྣམ་པར་གདོན་མི་ཟ་བའི་དོན་ཞེས་བྱ། །
en: The one who is supreme in the world, Śāntārtha, Will be born in a place called Meaning Beyond Doubt.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་གཟི་བརྗིད་དབང་པོ་ཡབ། །གཟི་བརྗིད་འོད་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend ten leagues. Splendid Ruler will be his father, and Splendid Light will be this victor’s mother.

source: སྲས་པོ་སྟོན་བྱེད་ཡུལ་བཟངས་རིམ་གྲོ་པ། །
en: Teacher will be his son and Excellent Land his attendant.

source: ཡོན་ཏན་ཀུན་གྱི་མཆོག་མ་རྫུ་འཕྲུལ་ཅན། །
en: And Supreme Among All Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །མི་ཁོམ་སྲེད་པའི་དྲ་བ་གཅོད་པ་པོ། །དེ་དག་བྱེ་ཕྲག་བཅུ་བཞི་བཅུ་བཞི་ཡོད། །
en: There will be eight consecutive congregations, Each of them gathering one hundred forty million “Who cut through the web of business and craving.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: And when this teacher has attained nirvāṇa, His sacred Dharma will remain for twenty-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྟོང་གསུམ་འགྲོ་བ་ཐམས་ཅད་དབང་དུ་མཛད། །
en: “The relics of this victor will be abundant, Magnetizing everyone in the trichiliocosm.

source: ཆོས་ཀྱི་དབང་ཕྱུག་སྐྱོན་མེད་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སྐྱོན་རྣམས་རབ་ཏུ་སེལ་ཞེས་བྱ། །
en: The lord of Dharma, Adoṣa, Will be born in a place called Dispeller of All Flaws.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཉིས་ཡབ་ནི་རྒྱ་ཆེན་ཡིན། །ལྷ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend thirty-two leagues. Vast will be his father, and Supreme Divinity will be this victor’s mother.

source: སྲས་པོ་ཁ་སྒྱུར་མཐུ་རྩལ་རིམ་གྲོ་པ། །
en: Leader will be his son and Powerful his attendant.

source: བསམ་གཏན་པ་ཡིས་བསྔགས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Praised by Meditators the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །མཚོ་ལྟར་གང་བ་དེ་དང་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering two hundred twenty million “Who are identical to the one who is like a brimming lake.

source: རྒོལ་བ་ཚར་གཅོད་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་དགུ་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of this eliminator of attacks Will remain for ninety-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་གཅིག་པ་བླ་རེ་སྟོང་དང་ལྡན། །
en: “The relics of this victor will reside in a single stūpa One league large and adorned with thousands of canopies.

source: བདེ་བར་གཤེགས་པ་བློ་དབྱངས་དགེ་བ་ཡི། །སྐྱེ་ཡུལ་དགེ་བ་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The well-gone Śubha­cīrṇa­buddhi Will be born in a place called Illuminating Virtues.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅུ་ཡོད་ཡབ་ནི་བློ་བཟངས་ཡིན། །དགེ་འོད་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་བའི་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend ten leagues. Excellent Mind will be his father, and Light of Virtue will be this victor’s mother. Master of Retention will be his son and Victorious his attendant.

source: འཇིག་རྟེན་སྣང་བར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Illuminating the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐམས་ཅད་ཆགས་མེད་གྱུར་པ་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering two hundred forty million “Who are all meditators free from attachment.

source: སྣང་བ་མེད་པར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: And after this teacher has gone beyond appearance His sacred Dharma will remain for twenty-four thousand years.

source: འགྲོ་བའི་དོན་དུ་རྒྱལ་བའི་སྐུ་གདུང་དག །འཇིག་རྟེན་གསུམ་ཀུན་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “For the benefit of wandering beings, the relics of this victor will reside in a single stūpa And will spread throughout and fill the three worlds.

source: རྡུལ་དང་བྲལ་བའི་པད་མའི་མཛོད་སྐྱེ་བའི། །ཡུལ་ནི་པད་མའི་ཕུང་པོ་ཞེས་ཀྱང་བྱ། །
en: The immaculate Padmakośa Will be born in a place called Heap of Lotuses.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་དྲུག་ཡབ་ནི་པད་མ་བཟང་། །པད་དཔལ་མ་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །སྙིང་རྗེ་ཆེན་པོ་ཐོག་ནི་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend seventy-six leagues. Excellent Lotus will be his father, and Lotus Glory will be this victor’s mother. Great Compassion will be his son and Crest his attendant.

source: ཡོན་ཏན་མེ་ཏོག་འཛིན་པ་བློ་ཅན་ཏེ། །
en: “Holder of the Flower of Excellent Qualities will be the one of intelligence

source: མཆོག་སྲེད་ཅེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Craving the Supreme the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་གསུམ་ཀུན་ལ་ཡང་། །ཆ་གཉིས་དག་ལས་རྣམ་གྲོལ་དགྲ་བཅོམ་མཆོག །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be thirteen consecutive congregations, Each of them gathering two hundred forty million supreme worthy ones “Who are free from the two extremes.

source: དམ་ཆོས་ལོ་གྲངས་ཉི་ཁྲི་བཞི་སྟོང་གནས། །
en: And the sacred Dharma will remain for twenty-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་བཅུ་དྲུག་སྟེ། །མཆོད་རྟེན་དེ་ཀུན་རིན་ཆེན་བདུན་ལས་བྱས། །
en: The relics of this victor will be abundant, “Residing in one hundred sixty billion stūpas That are all made of the seven precious substances.

source: འཇིག་རྟེན་མཆོག་མ་འོད་ཟེར་བཟང་པོ་ཡི། །སྐྱེ་ཡུལ་འོད་ཟེར་སྣང་བར་བྱེད་ཅེས་བྱ། །
en: The one who is supreme in the world, Suraśmi, Will be born in a place called Illuminating Radiance.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་འོད་ཟེར་ཆེན་པོ་ཡབ། །དགའ་བ་གྲགས་འཛིན་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend twenty-four leagues. Great Light Rays will be his father, and Holding Joy and Fame will be this victor’s mother.

source: སྲས་པོ་པད་མ་ལེགས་མཐོང་རིམ་གྲོ་པ། །
en: Lotus will be his son and Excellent Sight his attendant.

source: ཆགས་པ་མེད་པའི་སྒྲ་ནི་བློ་ཅན་ཏེ། །
en: “Sound of the Absence of Attachment will be the one of intelligence

source: གླེང་བའི་ང་རོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Roaring Discussion the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །མེ་འོད་འཕྲོ་བ་ལྟར་ནི་ཆགས་མེད་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be twenty consecutive congregations, Each of them gathering three hundred twenty million “Who are free from attachment and shine like fire.

source: ཡོངས་སུ་མྱ་ངན་འདས་ནས་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ལྔ་སྟོང་བར་དུ་གནས། །
en: And when this teacher has attained parinirvāṇa His sacred Dharma will remain for twenty-five thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱ་པ་གསེར་གྱི་འོད་དང་ལྡན། །
en: “The relics of this victor will reside in a single stūpa One hundred leagues large and shining with golden light.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པའི་མདོག་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་སྤོབས་པའི་མདོག་ཅེས་བྱ། །
en: The thus-gone Pratibhāna­varṇa Will be born in a place called Colors of Acumen.

source: རྒྱལ་བ་དེ་ཡི་རིགས་ནི་བྲམ་ཟེ་ཡིན། །འོད་ནི་མཐའ་ཡས་བདག་ཉིད་ཆེན་པོ་ཡབ། །འོད་ཀྱི་ཁ་དོག་ཅན་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will be infinite. Great Being of Infinite Light will be his father, and Having Light Hues will be this victor’s mother.

source: རིན་ཆེན་མཆོག་སྲས་ཤེས་ལྡན་རིམ་གྲོ་པ། །
en: Supreme Jewel will be his son and Possessor of Knowledge his attendant.

source: སྤོབས་པའི་དབྱངས་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ
en: “Melody of Acumen will be the one of intelligence

source: ཤེས་རབ་རྣམ་པར་འཕྲུལ་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Miraculous Display of Insight the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཆགས་དང་བྲལ་བར་གྱུར་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་གཉིས་གཉིས་ཡོད། །
en: There will be eighty consecutive congregations, Each of them gathering three hundred twenty million “Meditators who are free from desire.

source: ཡོན་ཏན་མངོན་དགྱེས་པ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: And the sacred Dharma of the one who delights in excellent qualities Will remain for twenty-two thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་ཕྲག་དྲུག་ཅུ་འབྱུང་། །
en: “The relics of this victor will be abundant, Residing six hundred billion stūpas.

source: མི་ཡི་འདྲེན་པ་སྟེགས་ནི་བཟང་པོ་ཡི། །སྐྱེ་ཡུལ་འཕགས་པ་དད་པར་བྱེད་ཅེས་བྱ། །
en: The guide of humans, Sutīrtha, Will be born in a place called Instiller of Faith in Noble Beings.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གསུམ་ཡབ་ནི་དོན་ཆེན་ཡིན། །བདུད་རྩིའི་ང་རོ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-three leagues. Great Objective will be his father, and Nectar Roar will be this victor’s mother.

source: སྲས་པོ་ཞི་བ་ཉེར་ཞི་རིམ་གྲོ་པ། །
en: Peace will be his son and Thorough Peace his attendant.

source: མཐུ་རྩལ་མཐའ་ཡས་པ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Infinite Power the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་དྲུག་ཀུན་ལའང་། །འཇིག་རྟེན་བདེ་དང་ཕན་ཕྱིར་གནས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: There will be thirty-six consecutive congregations, Each of them gathering two hundred forty million “Who remain for the sake of bringing the world happiness and help.

source: དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲི་དྲུག་སྟོང་གནས། །
en: And the sacred Dharma of the one who delights in excellent qualities Will remain for thirty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ལ། །དཔག་ཚད་བཅུ་གསུམ་པ་སྟེ་གསེར་གྱིས་སྤྲས། །རྒྱལ་མཚན་བྱེ་བ་སྟོང་གིས་མཛེས་པར་བྱས། །
en: “The relics of this victor will reside in a single stūpa Thirteen leagues large and decorated with gold and billions of banners.

source: ཡོན་ཏན་རྒྱ་མཚོ་ཚོགས་ཀྱི་དབང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དབང་པོས་བརྒྱན་ཅེས་བྱ། །
en: The ocean of qualities, Gaṇendra, Will be born in a place called Adorned with the Ruler.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཅིག་དགའ་བའི་དབང་པོ་ཡབ། །ཚོགས་ཅན་སྤོང་ནི་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །འཕགས་པ་དད་བྱེད་དེས་པ་རིམ་གྲོ་པ། །
en: “His family will be kṣatriya, And his light will extend twenty-one leagues. Joyous Ruler will be his father, and Relinquishment Endowed with Gathering will be this victor’s mother. Instiller of Faith in Noble Beings will be his son and Gentle his attendant.

source: ཐར་པ་དགའ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Joy in Liberation will be the scholar

source: བདེན་ལ་དད་པར་བྱེད་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Instiller of Faith in the Truth the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་དྲུག་ཀུན་ལ་ཡང་། །མི་སློབ་འབྲས་བུ་དག་ནི་ཐོབ་པ་པོ། །འབུམ་ཕྲག་ཉི་ཤུ་བཞི་བཞི་འདུས་པར་འགྱུར། །
en: There will be sixteen consecutive congregations, Each of them gathering two million four hundred thousand “Who have attained the fruition of no more training.

source: དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་བརྒྱད་གནས། །
en: And the sacred Dharma will also remain for eighteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་དགུ་པ་མུ་ཏིག་བླ་རེར་ལྡན། །གསེར་གྱི་རྒྱལ་མཚན་སྟོང་གིས་འཁོར་བར་བསྐོར། །
en: The relics of this victor will reside in a single stūpa Nine leagues large, decorated with pearl canopies, And surrounded by thousands of golden banners.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་དང་བྲལ་བ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་མི་འཇིགས་སྦྱིན་ཞེས་བྱ། །
en: The thus-gone Vigatabhaya Will be born in a place called Gift of Fearlessness.

source: དཔག་ཚད་དྲུག་ཅུ་ཡབ་ནི་སྐྲག་མེད་ཡིན། །ཀླུ་འོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: And his light will extend sixty leagues. Undaunted will be his father, and Nāga Light will be this victor’s mother.

source: སྲས་པོ་དགའ་བྱེད་མཐུ་རྩལ་རིམ་གྲོ་པ། །
en: Instiller of Joy will be his son and Power his attendant.

source: གནོད་མེད་པ་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: “Unimpaired will be the scholar

source: འཇིགས་པ་མེད་པའི་མཆོད་རྟེན་རྫུ་འཕྲུལ་ཅན། །
en: And Stūpa of Fearlessness the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །ཆ་གཉིས་དག་ལས་རྣམ་གྲོལ་མི་སློབ་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: There will be seventy-six consecutive congregations, Each of them gathering two hundred twenty million “Who are free from the two extremes and beyond training.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་བཞིའི་བར་དུ་གནས། །
en: And when this teacher has attained nirvāṇa His sacred Dharma will remain for fourteen thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འཇིག་རྟེན་ཁམས་རྣམས་ཐམས་ཅད་གང་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Filling all the realms of the world.

source: བདེ་བར་གཤེགས་པ་ཡེ་ཤེས་བཞེད་པ་ཡི། །སྐྱེ་ཡུལ་ཡེ་ཤེས་རྣམ་པར་སྒྲོགས་ཞེས་བྱ། །
en: The well-gone Jñānaruci Will be born in a place called Proclamation of Wisdom.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་ལེགས་ཤེས་ལྡན། །ཡེ་ཤེས་ལྷུན་གྲུབ་མ་ནི་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be brahmin, And his light will extend three leagues. Possessor of Excellent Knowledge will be his father, and Spontaneously Present Wisdom will be this victor’s mother.

source: སྲས་པོ་ཤེས་མཆོག་ནུས་ལྡན་རིམ་གྲོ་པ། །
en: Supreme Knowledge will be his son and Powerful his attendant.

source: ཡེ་ཤེས་རི་བོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: “Mountain of Wisdom will be the scholar

source: ཡེ་ཤེས་མཐོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Seeing Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །པད་མ་ལྟ་བུར་སྲིད་པས་མི་གོས་པ། །བྱེ་བ་ཕྲག་ནི་སུམ་ཅུ་དྲུག་དྲུག་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering three hundred sixty million “Who are like lotuses, unstained by existence.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བཅུ་པ་རིན་པོ་ཆེས་སྤྲས་ཤིང་། །རྣ་རྒྱན་དག་གིས་མཛེས་བྱས་གསེར་གྱིས་སྤྲས། །
en: The relics of this victor will reside in a single stūpa “Ten leagues large and studded with jewels, Beautifully decorated and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་སྤོབས་པའི་སྤྱན་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་འཇིག་རྟེན་མཐོང་ཞེས་བྱ། །
en: The thus-gone Pratibhāna­cakṣus Will be born in a place called Seeing the World.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གསུམ་ཡབ་ནི་སྤྱན་ལེགས་ཡིན། །མིག་སྡུག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend thirty-three leagues. Excellent Eye will be his father, and Beautiful Eye will be this victor’s mother.

source: སྲས་པོ་གཉེན་པོ་བློ་ཆེན་རིམ་གྲོ་པ། །
en: Remedy will be his son and Great Mind his attendant.

source: སྤོབས་པའི་སྙིང་སྟོབས་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Strength of the Essence of Acumen will be the one of intelligence

source: རྣམ་པར་གྲོལ་བར་གནས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Dwelling in Liberation the one of miracles.

source: འདུས་པ་དག་ནི་ལན་གྲངས་དྲུག་ཅུ་སྟེ། །འབྲས་བུའི་མཆོག་མ་དགྲ་བཅོམ་ཐོབ་པ་པོ། །འབུམ་ཕྲག་ཉི་ཤུ་རྩ་ནི་གཉིས་གཉིས་ཡོད། །
en: There will be sixty consecutive congregations, Each of them gathering two million two hundred thousand “Who have attained the supreme fruition of the worthy ones.

source: འཇིག་རྟེན་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །མྱ་ངན་འདས་ནས་ལོ་སྟོང་བར་དུ་གནས། །
en: And for the sake of the world the sacred Dharma Will remain for one thousand years subsequent to nirvāṇa.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་བྱེ་བ་སྟོང་དུ་ཚང་བར་འགྱུར། །
en: “The relics of this victor will be abundant, Remaining complete within ten billion stūpas.

source: དེ་བཞིན་གཤེགས་པ་བློ་ཡི་མཆོག་མ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་ཡི་ཚོགས་ཞེས་བྱ། །
en: The thus-gone Varabuddhi Will be born in a place called Gathering of the Mind.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་བློ་བཟངས་ཡིན། །འོད་འཕྲོ་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “The family of this victor will be kṣatriya, And his light will extend nine leagues. Excellent Mind will be his father, and Radiant will be this victor’s mother.

source: སྲས་པོ་ཆོས་ལྡན་ཆོས་བཟངས་རིམ་གྲོ་པ། །
en: Endowed with Dharma will be his son and Excellent Dharma his attendant.

source: སྤོབས་པའི་བློ་ནི་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Mind of Acumen will be the one of intelligence

source: ལེགས་པ་བསགས་པའི་བློ་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Mind of Excellent Accumulation the one of miracles.

source: དྲི་གསུམ་དྲི་མ་ཤིན་ཏུ་དྲི་མེད་པ། །དགྲ་བཅོམ་བསམ་གཏན་པ་ནི་ཐེར་འབུམ་སྙེད། །དེ་དག་ཐམས་ཅད་ལྷ་མི་ཕན་ཕྱིར་འདུས། །
en: One billion meditators who are worthy ones Utterly free from the three stains “Will gather for the sake of gods and humans.

source: མི་ཚེ་ལོ་གྲངས་དགུ་ཁྲི་བརྒྱད་སྟོང་ཡིན། །
en: The lifespan of humans will be ninety-eight thousand years,

source: མྱ་ངན་འདས་ནས་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་ཉི་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: And when this teacher has attained nirvāṇa His sacred Dharma will remain for twenty-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱད་པ་ཁོར་ཡུག་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa Eight leagues high and adorned with canopies everywhere.

source: ཆོས་ཀྱི་དབང་ཕྱུག་ཟླ་བ་སྐྱེ་བ་ཡི། །ཡུལ་ནི་སྣང་བ་གསལ་བར་བྱེད་ཅེས་བྱ། །
en: The lord of Dharma, Candra, Will be born in a place called Illuminating Light.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་མིག་བཟངས་ཡིན། །ཟླ་བཞིན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be brahmin, And his light will extend twenty-two leagues. Excellent Eye will be his father, and Moonlight will be this victor’s mother.

source: སྲས་པོ་ཞི་ལྡན་ལྷ་དབང་རིམ་གྲོ་པ། །
en: Peaceful will be his son and Divine King his attendant.

source: འཇིག་རྟེན་བསྔགས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Praised by the World the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་གཉིས་ཀུན་ལའང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཟང་ཟིང་མེད་པ་པོ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: There will be twenty-two consecutive congregations, Each of them gathering two hundred million “Who are all worthy ones free from mundane business.

source: ཐུགས་རྗེ་ཆེན་པོའི་རྒྱལ་བའི་སྐུ་གདུང་དག །ཞིང་རྣམས་དག་ཏུ་རྒྱས་ཤིང་གང་བར་འགྱུར། །
en: “The relics of this victor of great compassion Will be abundant and fill all the realms.

source: དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཟླ་འོད་ཀྱི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་ཏོག་ཅེས་བྱ། །
en: The thus-gone Ratnābhacandra Will be born in a place called Crest of Intelligence.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གསུམ་ཡབ་ནི་འོད་ལྡན་ཡིན། །ལྷ་མཆོད་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: “His family will be kṣatriya, And his light will extend twenty-three leagues. Endowed with Light will be his father, and Divine Worship will be this victor’s mother.

source: སྲས་པོ་མཐའ་ཡས་བཞིན་སྡུག་རིམ་གྲོ་པ། །
en: Infinite will be his son and Delightful Countenance his attendant.

source: སྣང་བྱིན་ཅེས་བྱ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: “Light Gift will be the one of intelligence

source: འཕགས་པར་གཞོལ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Noble Diligence the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་བཞི་ཀུན་ལའང་། །གཏི་མུག་མེད་གྱུར་ཞི་བའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་ཁྲི་ཕྲག་གཉིས་གཉིས་ཡོད། །
en: There will be twenty-four consecutive congregations, Each of them gathering two hundred billion “Serene meditators who are free from dullness.

source: མགོན་པོ་མཆོག་མ་མྱ་ངན་འདས་ནས་ཀྱང་། །དམ་ཆོས་ལོ་གྲངས་བདུན་ཁྲི་དྲུག་སྟོང་གནས། །
en: And when this supreme protector has attained nirvāṇa His sacred Dharma will remain for seventy-six thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་བརྒྱ་པ་ཁོར་ཡུག་བླ་རེར་ལྡན། །
en: “The relics of this victor will reside in a single stūpa One hundred leagues large and covered by canopies.
